DataProcessors/бит_ВыгрузкаКазань.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ВыгрузкаКазань</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводИнформации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводИнформации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевыеСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРеестра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сг_ИмяФайлаВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сг_Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сг_КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сг_НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстИтогоДокумент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстИтогоФайл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПлатежнаяСистема</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПлатежныеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтборЛицевыхСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачислениеПениПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачислениеПениПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/бит_ВыгрузкаКазань/Forms/Форма/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте
Перем мПлатежныеСистемы; // Хранит список платежных систем.

&НаКлиенте
Перем мСписокКодировок;  // Хранит список кодировок.

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Элементы.СтраницыОтбор.Видимость = (Объект.ЛицевыеСчета = "По выбору");
	
	Элементы.ВидОперации.Доступность = ЗначениеЗаполнено(Объект.Организация);
	
	Элементы.РабочаяПанель.Видимость = Истина;
	
	НайденныйЭлемент = Элементы.ВидОперации.СписокВыбора.НайтиПоЗначению("Загрузка");
	Если НайденныйЭлемент = Неопределено Тогда
		Элементы.ВидОперации.СписокВыбора.Добавить("Загрузка","Загрузка");
	КонецЕсли;
	
	Элементы.РабочаяПанель.ТекущаяСтраница = Элементы.Выгрузка;
	
	Элементы.ГруппаВыводИнформации.Видимость = Истина;
	
	Объект.Вручную = Ложь;
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Перечисления.
	КэшПеречисления = Новый Структура;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.НомерФайла = 0 Тогда
		Объект.НомерФайла = 1;
	КонецЕсли;	  
	
	Объект.Дата = Формат(ТекущаяДата(),"ДФ=ггггММдд");
	
	Если  Объект.сг_ИмяФайлаВыгрузки = "" Тогда
		
		Объект.сг_ИмяФайлаВыгрузки = "C:\";
		
	КонецЕсли;	
	
	Объект.ВыводИнформации = "С разбивкой по услугам";
	Объект.ВводИнформации  = "С разбивкой по услугам";
	Объект.Вручную         = Ложь;
	
	Если НЕ ЗначениеЗаполнено(сг_СимволРазделения) Тогда
		
		сг_СимволРазделения = "|";
		
	КонецЕсли;
	
	сг_ИмяЛСВФайле = Элементы.сг_ВыгружатьЛС.СписокВыбора[0].Значение;
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	УправлениеЭлементамиФормы();
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	Массив.Добавить(Тип("Число"));
	Массив.Добавить(Тип("Дата"));
	
	КЧ = Новый КвалификаторыЧисла(15,2);
	КС = Новый КвалификаторыСтроки(100);
	КД = Новый КвалификаторыДаты();
	
	Элементы.УсловиеОтбора.СписокВыбора.Добавить(ВидСравнения.ВСписке);
	Элементы.УсловиеОтбора.СписокВыбора.Добавить(ВидСравнения.НеВСписке);
	
	УсловиеОтбора = ВидСравнения.ВСписке;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.СтраницыОтбор.Видимость = (Объект.ЛицевыеСчета = "По выбору");
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЛицевыеСчетаПриИзменении(Элемент)
	
	Элементы.СтраницыОтбор.Видимость = (Объект.ЛицевыеСчета = "По выбору");
	
КонецПроцедуры

&НаКлиенте
Процедура сг_ИмяФайлаВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Заголовок               = "Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр = Ложь;
	ДиалогВыбораФайла.ИндексФильтра           = 0;
	ДиалогВыбораФайла.ПолноеИмяФайла          = Объект.сг_ИмяФайлаВыгрузки;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Объект.сг_ИмяФайлаВыгрузки = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура сг_ИмяФайлаВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	ЗапуститьПриложение(Объект.сг_ИмяФайлаВыгрузки);
	СтандартнаяОбработка = ЛОЖЬ;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЛицевыхСчетовЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", Объект.Организация);
	
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.ПодразделениеОрганизации = ПредопределенноеЗначение("Справочник.бит_ПодразделенияОрганизаций.ПустаяСсылка");
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборЛицевыхСчетовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ОбработатьВыбранныеЗначения(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ссылка",Объект.Организация);
	
	ОткрытьФорму("Справочник.бит_ПодразделенияОрганизаций.Форма.ФормаВыбораУправляемая",Новый Структура("ОткрытьИзОбработкиВыгрузкаКазань",ПараметрыФормы),Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура сг_НачалоПериодаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачалоМесяцаВыгрузки = НачалоМесяца(ВыбранноеЗначение);
	КонецМесяцаВыгрузки = КонецМесяца(ВыбранноеЗначение);
	
	Объект.сг_НачалоПериода = НачалоМесяцаВыгрузки;
	Объект.сг_КонецПериода = КонецМесяцаВыгрузки;
	
КонецПроцедуры

&НаКлиенте
Процедура сг_КонецПериодаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачалоМесяцаВыгрузки = НачалоМесяца(ВыбранноеЗначение);
	КонецМесяцаВыгрузки = КонецМесяца(ВыбранноеЗначение);
	
	Объект.сг_НачалоПериода = НачалоМесяцаВыгрузки;
	Объект.сг_КонецПериода = КонецМесяцаВыгрузки;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерФайлаПриИзменении(Элемент)
	
	Если Элемент.ТекстРедактирования = "0" Тогда
		
		Объект.НомерФайла = 1;

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Номер файла должен быть больше 0");
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ВыбратьСтандартныйПериод(Команда)
	
	СтандартныйПериод.ДатаНачала         = Объект.сг_НачалоПериода;
	СтандартныйПериод.ДатаОкончания      = Объект.сг_КонецПериода;
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = СтандартныйПериод;
	Диалог.Показать(Новый ОписаниеОповещения("ВыбратьСтандартныйПериодЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСтандартныйПериодЗавершение(Период, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	
	Если Период Тогда
		СтандартныйПериод = Диалог.Период;
		Объект.сг_НачалоПериода    = СтандартныйПериод.ДатаНачала;
		Объект.сг_КонецПериода     = СтандартныйПериод.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузку(Команда)
	
	Текст = Новый ТекстовыйДокумент;
	
	сгВыгрузить(Текст);
	
	Попытка
		Текст.Записать(Объект.сг_ИмяФайлаВыгрузки, КодировкаТекста[Кодировка]);
	Исключение
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(""+ ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация"       , Объект.Организация);
	ПараметрыФормы.Вставить("Дата"              , Объект.сг_КонецПериода);
	ПараметрыФормы.Вставить("ОткрытоИзДокумента", Истина);
	
	ОткрытьФорму("Обработка.бит_ПодборЛицевыхСчетов.Форма", ПараметрыФормы, Элементы.ОтборЛицевыхСчетов, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Настройка(Команда)
	
	ОткрытьФорму("Обработка.бит_ВыгрузкаКазань.Форма.ФормаНастройки",,,,,, Новый ОписаниеОповещения("НастройкаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура сгВыгрузить(Текст)
	
	ИспользоватьНомерПолучателя = Ложь;
	НомерПолучателяПоБанку      = 0;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИспользоватьНомерПолучателяВШК", ИспользоватьНомерПолучателя);
	СтруктураПараметров.Вставить("НомерПолучателяПоБанку"        , НомерПолучателяПоБанку);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(Объект.сг_КонецПериода), Объект.Организация, СтруктураПараметров);
	
	ИспользоватьНомерПолучателя = СтруктураПараметров.ИспользоватьНомерПолучателяВШК;
	НомерПолучателяПоБанку      = СтруктураПараметров.НомерПолучателяПоБанку;
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	
	ПостроительЗапроса.Параметры.Вставить("НачалоПериода", НачалоДня(Объект.сг_НачалоПериода));
	ПостроительЗапроса.Параметры.Вставить("КонецПериода" , КонецДня(Объект.сг_КонецПериода));
	ПостроительЗапроса.Параметры.Вставить("Организация"  , Объект.Организация);
	
	ПостроительЗапроса.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
	|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаНачальныйОстаток) КАК НачальноеСальдо,
	|	СУММА(бит_НачисленияПоУслугамЖКХОстаткиИОбороты.СуммаКонечныйОстаток) КАК КонечноеСальдо,
	|	СУММА(0) КАК НачальноеСальдоПени,
	|	СУММА(0) КАК КонечноеСальдоПени
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ЛицевойСчет.Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениНачальныйОстаток),
	|	СУММА(бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.СуммаПениКонечныйОстаток)
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ЛицевойСчет.Организация = &Организация) КАК бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ,
	|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.ЛицевойСчет,
	|	Остатки.УслугаЖКХ,
	|	СУММА(Остатки.НачальноеСальдо) КАК НачальноеСальдо,
	|	СУММА(Остатки.КонечноеСальдо) КАК КонечноеСальдо,
	|	СУММА(Остатки.НачальноеСальдоПени) КАК НачальноеСальдоПени,
	|	СУММА(Остатки.КонечноеСальдоПени) КАК КонечноеСальдоПени
	|ПОМЕСТИТЬ ГрупОстатки
	|ИЗ
	|	Остатки КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.ЛицевойСчет,
	|	Остатки.УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНачислений,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаОплаты,
	|	СУММА(0) КАК СуммаПени,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Разовые
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ЛицевойСчет.Организация = &Организация) КАК бит_НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(бит_НачислениеПениПоУслугамЖКХОбороты.СуммаПениОборот),
	|	0
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(&НачалоПериода, &КонецПериода, , ЛицевойСчет.Организация = &Организация) КАК бит_НачислениеПениПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Обороты.ЛицевойСчет,
	|	Обороты.УслугаЖКХ,
	|	СУММА(Обороты.СуммаНачислений) КАК СуммаНачислений,
	|	СУММА(Обороты.СуммаОплаты) КАК СуммаОплаты,
	|	СУММА(Обороты.СуммаПени) КАК СуммаПени,
	|	СУММА(Обороты.Разовые) КАК Разовые
	|ПОМЕСТИТЬ ГрупОбороты
	|ИЗ
	|	Обороты КАК Обороты
	|
	|СГРУППИРОВАТЬ ПО
	|	Обороты.ЛицевойСчет,
	|	Обороты.УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета
	|ПОМЕСТИТЬ СведенияПоУслугам
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.данет.да)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
	|	бит_ФИОПроживающихСрезПоследних.Фамилия,
	|	бит_ФИОПроживающихСрезПоследних.Имя,
	|	бит_ФИОПроживающихСрезПоследних.Отчество,
	|	бит_ФИОПроживающихСрезПоследних.ФизЛицо.ДатаРождения КАК ДатаРождения
	|ПОМЕСТИТЬ ОтветсвенныеЛица
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних(&КонецПериода, ) КАК бит_ФИОПроживающихСрезПоследних
	|		ПО бит_ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
	|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ бит_ПроживающиеПоЛССрезПоследних.ФизЛицо) КАК КолПроживающих
	|ПОМЕСТИТЬ Проживающие
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&КонецПериода, ЛицевойСчет.Организация = &Организация) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	(бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &КонецПериода
	|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
	|	И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица.ПроживаниеВДанныйМомент
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СведенияОКвартиреСрезПоследних.Квартира,
	|	бит_СведенияОКвартиреСрезПоследних.ОбщаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ОтапливаемаяПлощадь,
	|	бит_СведенияОКвартиреСрезПоследних.ТипКвартиры,
	|	бит_СведенияОКвартиреСрезПоследних.СтатусКвартиры
	|ПОМЕСТИТЬ СведенияОКвартре
	|ИЗ
	|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(
	|			&КонецПериода,
	|			Квартира В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					Таб.ЛицевойСчет.Квартира
	|				ИЗ
	|					СведенияПоУслугам КАК Таб)) КАК бит_СведенияОКвартиреСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СведенияПоУслугам.ЛицевойСчет КАК ЛицевойСчет,
	|	СведенияПоУслугам.ЛицевойСчет.Наименование КАК НаименованиеЛС,
	|	СведенияПоУслугам.ЛицевойСчет.Идентификатор КАК ИдентификаторЛицевогоСчета,
	|	СведенияПоУслугам.Услуга КАК Услуга,
	|	СведенияПоУслугам.Услуга.Код КАК КодУслуги,
	|	ОтветсвенныеЛица.ФизЛицо КАК ФИО,
	|	ОтветсвенныеЛица.Фамилия КАК Фамилия,
	|	ОтветсвенныеЛица.Имя КАК Имя,
	|	ОтветсвенныеЛица.Отчество КАК Отчество,
	|	СведенияПоУслугам.ЛицевойСчет.Здание.Район КАК Город,
	|	СведенияПоУслугам.ЛицевойСчет.УлицаЛицевогоСчета КАК Улица,
	|	СведенияПоУслугам.ЛицевойСчет.Здание КАК Здание,
	|	СведенияПоУслугам.ЛицевойСчет.Здание.Корпус КАК Корпус,
	|	СведенияПоУслугам.ЛицевойСчет.Квартира КАК Квартира,
	|	ЕСТЬNULL(Проживающие.КолПроживающих, 0) КАК КолПроживающих,
	|	ЕСТЬNULL(СведенияОКвартре.ОбщаяПлощадь, 0) КАК ОбщаяПлощадь,
	|	ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) КАК СуммаНачислений,
	|	ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) КАК СуммаОплаты,
	|	ЕСТЬNULL(ГрупОбороты.СуммаПени, 0) КАК СуммаПени,
	|	ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) КАК НачальноеСальдо,
	|	ЕСТЬNULL(ГрупОстатки.КонечноеСальдо, 0) КАК КонечноеСальдо,
	|	ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0) КАК НачальноеСальдоПени,
	|	ЕСТЬNULL(ГрупОстатки.КонечноеСальдоПени, 0) КАК КонечноеСальдоПени,
	|	ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0) КАК НачальноеСальдоСУчетомПени,
	|	ЕСТЬNULL(ГрупОстатки.КонечноеСальдоПени, 0) + ЕСТЬNULL(ГрупОстатки.КонечноеСальдо, 0) КАК КонечноеСальдоСУчетомПени,
	|	ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) КАК НачальноеСальдоСУчетомОплаты,
	|	ЕСТЬNULL(ГрупОстатки.НачальноеСальдо, 0) + ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОстатки.НачальноеСальдоПени, 0) КАК НачальноеСальдоСУчетомОплатыИПени,
	|	ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) + ЕСТЬNULL(ГрупОбороты.СуммаПени, 0) КАК СуммаНачисленийСУчетомПени,
	|	ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) КАК СуммаНачисленийСУчетомОплаты,
	|	ЕСТЬNULL(ГрупОбороты.СуммаОплаты, 0) + ЕСТЬNULL(ГрупОбороты.СуммаНачислений, 0) + ЕСТЬNULL(ГрупОбороты.СуммаПени, 0) КАК СуммаНачисленийСУчетомОплатыИПени,
	|	ОтветсвенныеЛица.ДатаРождения,
	|	ЕСТЬNULL(СведенияОКвартре.ОтапливаемаяПлощадь, 0) КАК ОтапливаемаяПлощадь,
	|	СведенияОКвартре.ТипКвартиры,
	|	СведенияОКвартре.СтатусКвартиры,
	|	СведенияПоУслугам.РежимПотребления,
	|	СведенияПоУслугам.Поставщик,
	|	СведенияПоУслугам.СпособРасчета,
	|	ЕСТЬNULL(ВложенныйЗапрос.Норма, 0) КАК Норма,
	|	ЕСТЬNULL(ВложенныйЗапрос.СверхНорма, 0) КАК СверхНорма,
	|	ЕСТЬNULL(ГрупОбороты.Разовые, 0) КАК Разовые
	|ИЗ
	|	СведенияПоУслугам КАК СведенияПоУслугам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГрупОстатки КАК ГрупОстатки
	|		ПО СведенияПоУслугам.ЛицевойСчет = ГрупОстатки.ЛицевойСчет
	|			И СведенияПоУслугам.Услуга = ГрупОстатки.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГрупОбороты КАК ГрупОбороты
	|		ПО СведенияПоУслугам.Услуга = ГрупОбороты.УслугаЖКХ
	|			И СведенияПоУслугам.ЛицевойСчет = ГрупОбороты.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОтветсвенныеЛица КАК ОтветсвенныеЛица
	|		ПО СведенияПоУслугам.ЛицевойСчет = ОтветсвенныеЛица.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ Проживающие КАК Проживающие
	|		ПО СведенияПоУслугам.ЛицевойСчет = Проживающие.ЛицевойСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОКвартре КАК СведенияОКвартре
	|		ПО СведенияПоУслугам.ЛицевойСчет.Квартира = СведенияОКвартре.Квартира
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|			бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Услуга КАК Услуга,
	|			бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Норма КАК Норма,
	|			бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.СверхНорма КАК СверхНорма
	|		ИЗ
	|			РегистрСведений.бит_СведенияОНормативахНачисленийЗакрытогоПериода.СрезПоследних КАК бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних) КАК ВложенныйЗапрос
	|		ПО СведенияПоУслугам.ЛицевойСчет = ВложенныйЗапрос.ЛицевойСчет
	|			И СведенияПоУслугам.Услуга = ВложенныйЗапрос.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеЛС
	|ИТОГИ
	|	СУММА(СуммаНачислений),
	|	СУММА(СуммаОплаты),
	|	СУММА(СуммаПени),
	|	СУММА(НачальноеСальдо),
	|	СУММА(КонечноеСальдо),
	|	СУММА(НачальноеСальдоПени),
	|	СУММА(КонечноеСальдоПени),
	|	СУММА(НачальноеСальдоСУчетомПени),
	|	СУММА(КонечноеСальдоСУчетомПени),
	|	СУММА(НачальноеСальдоСУчетомОплаты),
	|	СУММА(НачальноеСальдоСУчетомОплатыИПени),
	|	СУММА(СуммаНачисленийСУчетомПени),
	|	СУММА(СуммаНачисленийСУчетомОплаты),
	|	СУММА(СуммаНачисленийСУчетомОплатыИПени)
	|ПО
	|	ОБЩИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ГрупОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Обороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ГрупОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СведенияПоУслугам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ОтветсвенныеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Проживающие
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СведенияОКвартре";
	
	ПостроительЗапроса.ЗаполнитьНастройки();
	
	Если Объект.ОтборЛицевыхСчетов.Количество() > 0 Тогда
		
		ТабЛС    = Объект.ОтборЛицевыхСчетов.Выгрузить();
		Значение = Новый СписокЗначений;
		Значение.ЗагрузитьЗначения(ТабЛС.ВыгрузитьКолонку("ЛицевойСчет"));
		
		ОтборЛС = ПостроительЗапроса.Отбор.Добавить("ЛицевойСчет");
		ОтборЛС.ВидСравнения  = УсловиеОтбора;
		ОтборЛС.Значение      = Значение;
		ОтборЛС.Использование = Истина;
		
	КонецЕсли;
	
	// ПОЛЯ ИЗ ЗАПРОСА ДЛЯ СРОКИ ДОМОХОЗЯЙСТВО.	
	ПостроительЗапроса.ВыбранныеПоля.Очистить();
	ПостроительЗапроса.ВыбранныеПоля.Добавить("ЛицевойСчет");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("НаименованиеЛС");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("ИдентификаторЛицевогоСчета");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("Фамилия");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("Имя");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("Отчество");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("ДатаРождения");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("Город");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("Улица");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("Здание");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("Корпус");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("Квартира");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("КолПроживающих");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("ОбщаяПлощадь");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("ОтапливаемаяПлощадь");
	
	// ПОЛЯ ИЗ ЗАПРОСА ДЛЯ СТРОКИ УСЛУГА.	
	ПостроительЗапроса.ВыбранныеПоля.Добавить("Услуга");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("НачальноеСальдо");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("ТипКвартиры");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("СтатусКвартиры");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("РежимПотребления");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("Поставщик");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("СпособРасчета");
	
	ПостроительЗапроса.ВыбранныеПоля.Добавить("Норма");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("СверхНорма");
	
	ПостроительЗапроса.ВыбранныеПоля.Добавить("СуммаНачислений");
	
	ПостроительЗапроса.ВыбранныеПоля.Добавить("Разовые");
	ПостроительЗапроса.ВыбранныеПоля.Добавить("СуммаОплаты");
	
	
	// ФОРМИРОВАНИЕ ТАБЛИЦЫ Перерасчет.	
	ТЗПерерасчетЛьгот = СформироватьТаблицуПерерасчетЛьготНаСервере();
	
	// ФОРМИРОВАНИЕ ТАБЛИЦЫ Разовые.	
	ТЗРазовые = СформироватьТаблицуРазовыеНаСервере();
	
	// ФОРМИРОВАНИЕ ТАБЛИЦЫ ТАРИФОВ.	
	ТаблицаТарифов = СформироватьТаблицуТарифовНаСервере();
	
	// ФОРМИРОВАНИЕ ТАБЛИЦЫ ЛЬГОТНИКОВ.
	ТаблицаЛьготников = СформироватьТаблицуЛьготниковНаСервере();
	
	// ФОРМИРОВАНИЕ ТАБЛИЦЫ ЛЬГОТНИКОВ.
	ТаблицаЛьгот = СформироватьТаблицуЛьготНаСервере();
	
	// ФОРМИРОВАНИЕ ТАБЛИЦЫ Норм.
	ТЗНорм = СформироватьТаблицуНормНаСервере();
	
	// ВЫПОЛНЕНИЕ ЗАПРОСА.	
	ПостроительЗапроса.Выполнить();
	
	ПостроительЗапросаТаблицаЗначений = ПостроительЗапроса.Результат.Выгрузить();
	
	ПостроительЗапросаТаблицаЗначений.Свернуть("Услуга,ЛицевойСчет","Разовые");
	
	Если ПостроительЗапроса.Результат.Пустой() Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("За данный периода - данные не найдены.");
		
		Возврат;
	КонецЕсли; 
	
	ВыборкаОбщ = ПостроительЗапроса.Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НоваяСтрокаУслуги = Ложь;
	ПредыдущаяСтрокаЛС = "";
	ПредыдущийЛС = ПредопределенноеЗначение("Справочник.бит_ЛицевыеСчета.ПустаяСсылка");
	КолЛьготников = 0;
	КоличествоУслуг = 0;	
	ЕстьЛьготник = Ложь;
	НомерНосителяКатегорииЛьгот = 0;
	КоличествоСтрокПерерасчетов =0;
	КоличествоСтрокЛьгот = 0;
	
	СтруктураДанныхДляЗаголовка = ПолучитьДанныеДляСтрокиЗаголовка();
	
	Дата = СтруктураДанныхДляЗаголовка.Дата;
	Пользователь = СтруктураДанныхДляЗаголовка.Пользователь;
	Телефон = СтруктураДанныхДляЗаголовка.Телефон;
	МесяцГодНачислений = СтруктураДанныхДляЗаголовка.МесяцГодНачислений;
	КоличествоЛС = СтруктураДанныхДляЗаголовка.КоличествоЛС;
	ВерсияФормата = СтруктураДанныхДляЗаголовка.ВерсияФормата;
	
	Текст.ДобавитьСтроку("1" + сг_СимволРазделения + "Параметры поставщика" + сг_СимволРазделения 
	+ Объект.Организация + сг_СимволРазделения + Объект.ПодразделениеОрганизации
	+ сг_СимволРазделения + Объект.НомерФайла + сг_СимволРазделения
	+ Дата + сг_СимволРазделения + Телефон + сг_СимволРазделения + Пользователь
	+ сг_СимволРазделения + МесяцГодНачислений + сг_СимволРазделения + КоличествоЛС
	+ сг_СимволРазделения + ВерсияФормата + сг_СимволРазделения);
	
	// НАЧАЛО ЦИКЛА.	
	Пока ВыборкаОбщ.Следующий() Цикл
		
		Выборка = ВыборкаОбщ.Выбрать();
		
		Итого = 0;
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Лицевойсчет = ПредыдущийЛС Тогда
				
				НоваяСтрокаУслуги = Истина;

			Иначе
				
				НоваяСтрокаУслуги = Ложь;
				КолЛьготников = 0;
				НомерНосителяКатегорииЛьгот =0;
				ЕстьЛьготник = Ложь;
				
			КонецЕсли;
			
			НоваяСтрока = "";
			
			СимволРазделения = сг_СимволРазделения;
			
			Если НЕ Выборка.ЛицевойСчет = ПредыдущийЛС и НЕ НоваяСтрокаУслуги Тогда
				// ФОРМИРОВАНИЕ СТРОКИ ДОМОХОЗЯЙСТВА.
				НоваяСтрока = СформироватьСтрокуДомохозяйстваНаСервере(Выборка,НоваяСтрока,СимволРазделения,ТаблицаЛьготников,КолЛьготников,ПостроительЗапросаТаблицаЗначений,КоличествоУслуг,ПредыдущийЛС);
				
				// ДОБАВЛЕНИЕ СТРОКИ ДОМОХОЗЯЙСТВО В ТЕКСТОВЫЙ ФАЙЛ.				
				Текст.ДобавитьСтроку(НоваяСтрока);
				
				// ФОРМИРОВАНИЕ СТРОК ЛЬГОТНИКА И ДОБАВЛЕНИЕ В ТЕКСТОВЫЙ ФАЙЛ.
				Текст = СформироватьСтрокуЛьготникаНаСервере(Текст,Выборка,НоваяСтрока,СимволРазделения,ТаблицаЛьготников,НомерНосителяКатегорииЛьгот);
				
				// ФОРМИРОВАНИЕ СТРОКИ УСЛУГИ.
				Текст = СформироватьСтрокуУслугиНаСервере(Текст,Выборка,СимволРазделения,ТаблицаТарифов,ТаблицаЛьготников,КолЛьготников,КоличествоУслуг,ТаблицаЛьгот,ТЗПерерасчетЛьгот,ТЗРазовые,КоличествоСтрокПерерасчетов,ПредыдущийЛС,КоличествоСтрокЛьгот);
				
				КоличествоУслуг = 0;
				
				ПредыдущаяСтрокаЛС = НоваяСтрока;
				
				НоваяСтрокаУслуги = Ложь;
				
				ПредыдущийЛС = Выборка.Лицевойсчет;
				
			Иначе
				
				// ФОРМИРОВАНИЕ СТРОКИ УСЛУГИ.
				Текст = СформироватьСтрокуУслугиНаСервере(Текст,Выборка,СимволРазделения,ТаблицаТарифов,ТаблицаЛьготников,КолЛьготников,КоличествоУслуг,ТаблицаЛьгот,ТЗПерерасчетЛьгот,ТЗРазовые,КоличествоСтрокПерерасчетов,ПредыдущийЛС,КоличествоСтрокЛьгот);
				
				ПредыдущийЛС = Выборка.Лицевойсчет;
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СформироватьТаблицуНормНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Период,
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.ЛицевойСчет,
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Услуга,
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Норма,
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.СверхНорма,
	|	бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних.Регистратор
	|ИЗ
	|	РегистрСведений.бит_СведенияОНормативахНачисленийЗакрытогоПериода.СрезПоследних КАК бит_СведенияОНормативахНачисленийЗакрытогоПериодаСрезПоследних";
	
	Результат = Запрос.Выполнить();
	
	ТЗНорм = Результат.Выгрузить();
	
	ТЗНорм.Сортировать("Период Возр");
	
	Возврат ТЗНорм;
	
КонецФункции

&НаСервере
Функция СформироватьТаблицуПерерасчетЛьготНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХ.Регистратор,
	|	бит_НачисленияПоУслугамЖКХ.УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХ.Сумма,
	|	бит_НачисленияПоУслугамЖКХ.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХ.Регистратор.ВидОперации,
	|	бит_НачисленияПоУслугамЖКХ.ВидДвижения
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ КАК бит_НачисленияПоУслугамЖКХ
	|ГДЕ
	|	(бит_НачисленияПоУслугамЖКХ.Регистратор.ВидОперации = &ПерерасчетЛьгот
	|			ИЛИ бит_НачисленияПоУслугамЖКХ.Регистратор.ВидОперации = &ПерерасчетЛьготПоНедоставкиУслуг
	|			ИЛИ бит_НачисленияПоУслугамЖКХ.Регистратор.ВидОперации = &ПерерасчетЛьготПоОтсутствующим)";
	
	Запрос.УстановитьПараметр("ПерерасчетЛьгот", ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьгот"));
	Запрос.УстановитьПараметр("ПерерасчетЛьготПоНедоставкиУслуг", ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьготПоНедоставкиУслуг"));
	Запрос.УстановитьПараметр("ПерерасчетЛьготПоОтсутствующим", ПредопределенноеЗначение("Перечисление.бит_ВидыОперацийРазовыеПоЖКХ.ПерерасчетЛьготПоОтсутствующим"));
	
	Результат = Запрос.Выполнить();
	
	ТЗПерерасчетЛьгот = Запрос.Выполнить().выгрузить();
	ТЗПерерасчетЛьгот.Сортировать("ЛицевойСчет Возр");
	
	Возврат ТЗПерерасчетЛьгот;
	
КонецФункции	

&НаСервере
Функция СформироватьТаблицуРазовыеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХ.Регистратор,
	|	бит_НачисленияПоУслугамЖКХ.УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХ.Сумма,
	|	бит_НачисленияПоУслугамЖКХ.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХ.Регистратор.ВидОперации,
	|	бит_НачисленияПоУслугамЖКХ.ВидДвижения,
	|	бит_НачисленияПоУслугамЖКХ.Регистратор.Представление,
	|	ВЫБОР
	|		КОГДА бит_НачисленияПоУслугамЖКХ.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|			ТОГДА бит_НачисленияПоУслугамЖКХ.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаРазовых,
	|	бит_НачисленияПоУслугамЖКХ.Период
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ КАК бит_НачисленияПоУслугамЖКХ
	|ГДЕ
	|	бит_НачисленияПоУслугамЖКХ.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ";	
	
	Результат = Запрос.Выполнить();
	
	ТЗРазовые = Запрос.Выполнить().выгрузить();
	ТЗРазовые.Сортировать("Период Возр");
	
	Возврат ТЗРазовые;
	
КонецФункции	

&НаСервере
Функция СформироватьТаблицуТарифовНаСервере();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СтавкиНаУслугиСрезПоследних.Период,
	|	бит_СтавкиНаУслугиСрезПоследних.Услуга,
	|	бит_СтавкиНаУслугиСрезПоследних.РежимПотребления,
	|	бит_СтавкиНаУслугиСрезПоследних.Поставщик,
	|	бит_СтавкиНаУслугиСрезПоследних.СпособРасчета,
	|	бит_СтавкиНаУслугиСрезПоследних.СтатусКвартиры,
	|	бит_СтавкиНаУслугиСрезПоследних.ТипКвартиры,
	|	ЕСТЬNULL(бит_СтавкиНаУслугиСрезПоследних.Тариф, 0) КАК Тариф
	|ИЗ
	|	РегистрСведений.бит_СтавкиНаУслуги.СрезПоследних(&сг_КонецПериода, ) КАК бит_СтавкиНаУслугиСрезПоследних";
	
	Запрос.УстановитьПараметр("сг_КонецПериода", Объект.сг_КонецПериода);
	
	Результат = Запрос.Выполнить();
	
	ТаблицаТарифов = Результат.Выгрузить();
	
	ТаблицаТарифов.Сортировать("Период Возр");
	
	Возврат ТаблицаТарифов;
	
КонецФункции

&НаСервере
Функция СформироватьТаблицуЛьготниковНаСервере();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Льготы.ФизЛицо КАК ФизЛицо,
	|	Льготы.Льгота,
	|	Льготы.СрокДействияЛьготы,
	|	ФизЛица.СтатусФизЛица.НачислятьПоНорме КАК НачислятьПоНорме,
	|	ФизЛица.СтатусФизЛица.ПроживаниеВДанныйМомент КАК ПроживаниеВДанныйМомент,
	|	Льготы.СрокЛьготыИстек,
	|	ФизЛица.ЛицевойСчет,
	|	Льготы.Льгота.Код,
	|	Льготы.Льгота.КодПоГУГЦЖС,
	|	Льготы.Льгота.ВнешнийИдентификатор,
	|	ФизЛица.Фамилия,
	|	ФизЛица.Имя,
	|	ФизЛица.Отчество,
	|	ФизЛица.ДатаРождения,
	|	Льготы.Льгота.ТипДокумента КАК ТипУдостоверения,
	|	Льготы.Льгота.ТипДокумента.Код КАК НомерУдостоверенияЛьготника,
	|	Льготы.НомерДокумента,
	|	Льготы.СерияДокумента,
	|	Льготы.ДатаВыдачи,
	|	Льготы.КемВыдан
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|		ПроживающиеПоЛССрезПоследних.СтатусФизЛица КАК СтатусФизЛица,
	|		ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|		ПроживающиеПоЛССрезПоследних.СтатусПроживания КАК СтатусПроживания,
	|		ПроживающиеПоЛССрезПоследних.ДатаЗаписи КАК ДатаЗаписи,
	|		ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	|		ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	|		ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|		бит_ФИОПроживающихСрезПоследних.Фамилия КАК Фамилия,
	|		бит_ФИОПроживающихСрезПоследних.Имя КАК Имя,
	|		бит_ФИОПроживающихСрезПоследних.Отчество КАК Отчество,
	|		ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения КАК ДатаРождения
	|	ИЗ
	|		РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ) КАК ПроживающиеПоЛССрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ФИОПроживающих.СрезПоследних КАК бит_ФИОПроживающихСрезПоследних
	|			ПО ПроживающиеПоЛССрезПоследних.ФизЛицо = бит_ФИОПроживающихСрезПоследних.ФизЛицо
	|	ГДЕ
	|		(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|				ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))) КАК ФизЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_ЛьготыПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|			бит_ЛьготыПоЛССрезПоследних.Льготы КАК Льгота,
	|			бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы КАК СрокДействияЛьготы,
	|			ВЫБОР
	|				КОГДА бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы > &Момент
	|						ИЛИ бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ КАК СрокЛьготыИстек,
	|			бит_ЛьготыПоЛССрезПоследних.НомерДокумента КАК НомерДокумента,
	|			бит_ЛьготыПоЛССрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
	|			бит_ЛьготыПоЛССрезПоследних.КемВыдан КАК КемВыдан,
	|			бит_ЛьготыПоЛССрезПоследних.СерияДокумента КАК СерияДокумента
	|		ИЗ
	|			РегистрСведений.бит_ЛьготыПоЛС.СрезПоследних(&Момент, ) КАК бит_ЛьготыПоЛССрезПоследних) КАК Льготы
	|		ПО ФизЛица.ФизЛицо = Льготы.ФизЛицо
	|ГДЕ
	|	ФизЛица.СтатусФизЛица.ПравоНаЛьготы = ИСТИНА
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ФизЛицо)
	|ПО
	|	ОБЩИЕ";
	Запрос.УстановитьПараметр("Момент"		, Объект.сг_КонецПериода);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	ТаблицаЛьготников = Запрос.Выполнить().Выгрузить();
	
	ТаблицаЛьготников.Сортировать("ЛицевойСчет Возр");
	
	Возврат ТаблицаЛьготников;
	
КонецФункции

&НаСервере
Функция ПолучитьДанныеДляСтрокиЗаголовка()
	
	Дата = Формат(Объект.Дата,"ДФ=дд.ММ.гггг");
	
	Пользователь = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
	Телефон = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_КонтактнаяИнформация.Тип,
	|	бит_КонтактнаяИнформация.Вид,
	|	бит_КонтактнаяИнформация.Представление,
	|	бит_КонтактнаяИнформация.Объект
	|ИЗ
	|	РегистрСведений.бит_КонтактнаяИнформация КАК бит_КонтактнаяИнформация";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Строка(ВыборкаДетальныеЗаписи.Объект) = Строка(Пользователь) Тогда
			
			Телефон = ВыборкаДетальныеЗаписи.Представление;
			
		КонецЕсли;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Вид,
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Объект
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация";
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Строка(ВыборкаДетальныеЗаписи.Объект) = Строка(Пользователь) Тогда
			
			Телефон = ВыборкаДетальныеЗаписи.Представление;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	МесяцГодНачислений = Формат(Объект.сг_НачалоПериода,"ДФ=ММ.гггг");
	
	КоличествоЛС = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Результат = Запрос.Выполнить();
	Если не Результат.Пустой() Тогда
		
		ТаблицаЛС = Результат.Выгрузить();
		
		КоличествоЛС = ТаблицаЛС.Количество();
		
	КонецЕсли;	
	
	ВерсияФормата = "2.2";
	
	Если Объект.НомерФайла = 0 Тогда
		Объект.НомерФайла = 1;
	КонецЕсли;	  	
	
	СтруктураДанныхДляЗаголовка = Новый Структура;
	СтруктураДанныхДляЗаголовка.Вставить("Дата",Дата);
	СтруктураДанныхДляЗаголовка.Вставить("Пользователь",Пользователь);
	СтруктураДанныхДляЗаголовка.Вставить("Телефон",Телефон);
	СтруктураДанныхДляЗаголовка.Вставить("МесяцГодНачислений",МесяцГодНачислений);
	СтруктураДанныхДляЗаголовка.Вставить("КоличествоЛС",КоличествоЛС);
	СтруктураДанныхДляЗаголовка.Вставить("ВерсияФормата",ВерсияФормата);
	
	Возврат СтруктураДанныхДляЗаголовка;
	
КонецФункции

&НаСервере
Функция СформироватьСтрокуДомохозяйстваНаСервере(Выборка,НоваяСтрока,СимволРазделения,ТаблицаЛьготников,КолЛьготников,ПостроительЗапросаТаблицаЗначений,КоличествоУслуг,ПредыдущийЛС)
	
	// 1.	Тип строки (Фиксированное значение: 2).					
	ТипСтроки  = 2;
	
	НоваяСтрока  = НоваяСтрока + ТипСтроки + СимволРазделения;
	
	// 2.	№ персонифицированного счета.						
	ИД = Формат(Выборка.ИдентификаторЛицевогоСчета, "ЧГ=0");
	
	НоваяСтрока  = НоваяСтрока + ИД + СимволРазделения;
	
	// 3.	№ домохозяйства в системе поставщика (№ лицевого счета).						
	ЛицевойСчет = СокрЛП(Выборка.НаименованиеЛС);
	
	НоваяСтрока  = НоваяСтрока + ЛицевойСчет + СимволРазделения;
	
	// 4.	Фамилия квартиросъемщика.
	Фамилия = Выборка.Фамилия;
	
	НоваяСтрока  = НоваяСтрока + Фамилия + СимволРазделения;
	
	// 5.	Имя квартиросъемщика.
	Имя = Выборка.Имя;
	
	НоваяСтрока  = НоваяСтрока + Имя + СимволРазделения;
	
	// 6.	Отчество квартиросъемщика.						
	Отчество = Выборка.Отчество;
	
	НоваяСтрока  = НоваяСтрока + Отчество + СимволРазделения;
	
	// 7.	Дата рождения квартиросъемщика.						
	ДатаРождения = Выборка.ДатаРождения;
	
	НоваяСтрока  = НоваяСтрока + Формат(ДатаРождения,"ДФ=дд.ММ.гггг") + СимволРазделения;
	
	// 8.	Город/район.						                        
	Город = Выборка.Город;
	
	НоваяСтрока  = НоваяСтрока + Город + СимволРазделения;
	
	// 9.	Село/деревня.						
	СелоДеревня = "";
	
	НоваяСтрока  = НоваяСтрока + СелоДеревня + СимволРазделения;
	
	// 10.	Наименование улицы.						
	Улица = Выборка.Улица;
	
	НоваяСтрока  = НоваяСтрока + Улица + СимволРазделения;
	
	// 11.	Дом.				
	Дом = Выборка.Здание;
	
	НоваяСтрока  = НоваяСтрока + Дом + СимволРазделения;
	
	// 12.	Корпус.						
	Корпус = Выборка.Корпус;
	
	НоваяСтрока  = НоваяСтрока + Корпус + СимволРазделения;
	
	// 13.	Квартира.
	Квартира = Выборка.Квартира;
	
	НоваяСтрока  = НоваяСтрока + Квартира + СимволРазделения;
	
	// 14.	Комната.
	Комната = "";
	
	НоваяСтрока  = НоваяСтрока + Комната + СимволРазделения;
	
	// 15.	Количество жильцов.						
	КолПроживающих = Выборка.КолПроживающих;
	
	НоваяСтрока  = НоваяСтрока + КолПроживающих + СимволРазделения;
	
	// 16.	Количество комнат.						
	КоличествоКомнат = Выборка.Квартира.КоличествоКомнат;
	
	НоваяСтрока  = НоваяСтрока + КоличествоКомнат + СимволРазделения;
	
	// 17.	Общая площадь.						
	ОбщаяПлощадь = Выборка.ОбщаяПлощадь;
	
	Если ОбщаяПлощадь <= 0 Тогда
		ОбщаяПлощадь = 0;
	КонецЕсли;
	
	НоваяСтрока  = НоваяСтрока + ОбщаяПлощадь + СимволРазделения;
	
	// 18.	Отапливаемая площадь.						
	ОтапливаемаяПлощадь = Выборка.ОтапливаемаяПлощадь;
	
	Если ОтапливаемаяПлощадь <= 0 Тогда
		ОтапливаемаяПлощадь = 0;
	КонецЕсли;
	
	НоваяСтрока  = НоваяСтрока + ОтапливаемаяПлощадь + СимволРазделения;
	
	// 19.	Количество коров.
	НоваяСтрока  = НоваяСтрока + 0 + СимволРазделения;
	
	// 20.	Количество свиней.
	НоваяСтрока  = НоваяСтрока + 0 + СимволРазделения;
	
	// 21.	Количество коз и овец.
	НоваяСтрока  = НоваяСтрока + 0 + СимволРазделения;
	
	// 22.	Количество лошадей.
	НоваяСтрока  = НоваяСтрока + 0 + СимволРазделения;
	
	// 23.	Наличие эл. котла (1-да, 0 -нет).
	НоваяСтрока  = НоваяСтрока + 0 + СимволРазделения;
	
	// 24.	Наличие эл. плиты (1-да, 0 -нет).
	НоваяСтрока  = НоваяСтрока + 0 + СимволРазделения;
	
	// 25.	Наличие газовой плиты (1-да, 0 -нет).
	НоваяСтрока  = НоваяСтрока + 0 + СимволРазделения;
	
	// 26.	Наличие газовой колонки (1-да, 0 –нет).
	НоваяСтрока  = НоваяСтрока + 0 + СимволРазделения;
	
	// 27.	Наличие АГВ (1-да, 0 –нет).
	НоваяСтрока  = НоваяСтрока + 0 + СимволРазделения;
	
	// 28.	Код типа жилья по газоснабжению (из справочника).
	КодТипаЖильяПоГазоснабжению = Выборка.ЛицевойСчет.Здание.ТипЖилФонда.КодТипаЖильяПоГазоснабжению;
	Если КодТипаЖильяПоГазоснабжению = 0 Тогда
		КодТипаЖильяПоГазоснабжению = ""
	КонецЕсли;	
	
	НоваяСтрока  = НоваяСтрока + КодТипаЖильяПоГазоснабжению + СимволРазделения;
	
	// 29.	Код типа жилья по водоснабжению (из справочника).
	КодТипаЖильяПоВодоснабжению = Выборка.ЛицевойСчет.Здание.ТипЖилФонда.КодТипаЖильяПоВодоснабжению;
	Если КодТипаЖильяПоВодоснабжению = 0 Тогда
		КодТипаЖильяПоВодоснабжению = ""
	КонецЕсли;	
	
	НоваяСтрока  = НоваяСтрока + КодТипаЖильяПоВодоснабжению + СимволРазделения;
	
	// 30.	Количество строк по льготникам (Строка – льготник).						
	Для каждого Строка из ТаблицаЛьготников Цикл
		
		Если Строка.ЛицевойСчет = Выборка.ЛицевойСчет Тогда
			
			КолЛьготников = КолЛьготников + 1;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	НоваяСтрока  = НоваяСтрока + КолЛьготников + СимволРазделения;
	
	// 31.	Количество строк по услугам (Строка – услуга).
	
	КоличествоУслуг = 0;
	
	Если НЕ	ПредыдущийЛС = Выборка.Лицевойсчет Тогда
		
		Для каждого СтрокаУслуга из ПостроительЗапросаТаблицаЗначений Цикл
			
			Если СтрокаУслуга.ЛицевойСчет = Выборка.ЛицевойСчет Тогда
				
				КоличествоУслуг = КоличествоУслуг + 1;
				
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	НоваяСтрока  = НоваяСтрока + КоличествоУслуг + СимволРазделения;
	
	// 32.	Факт хищения коммунальных услуг.
	
	ФактХищения = 0;
	
	НоваяСтрока  = НоваяСтрока + ФактХищения + СимволРазделения;
	
	// 33.	Необходимость приостановки выплаты льгот за ЖКУ (1-да, 0 –нет).						
	
	НеобходимостьПриостановкиВыплатыЛьгот = 0;
	
	НоваяСтрока  = НоваяСтрока + НеобходимостьПриостановкиВыплатыЛьгот + СимволРазделения;
	
	Возврат НоваяСтрока;					
	
КонецФункции

&НаСервере
Функция СформироватьСтрокуЛьготникаНаСервере(Текст,Выборка,НоваяСтрока,СимволРазделения,ТаблицаЛьготников,НомерНосителяКатегорииЛьгот)
	
	Для Каждого СтрокаЛьготник из ТаблицаЛьготников Цикл
		
		Если СтрокаЛьготник.ЛицевойСчет = Выборка.ЛицевойСчет Тогда
			
			ЕстьЛьготник = Истина;
			
			КодЛьготы = СтрокаЛьготник.ЛьготаКодПоГУГЦЖС;
			
			НомерНосителяКатегорииЛьгот = НомерНосителяКатегорииЛьгот + 1;
			
			// 1.	Тип строки (Фиксированное значение: 3).
			ТипСтроки  = 3;
			
			НоваяСтрока  = "" + ТипСтроки + СимволРазделения;
			// 2.	Код льготной категории (из справочника).		
			НоваяСтрока  = НоваяСтрока + КодЛьготы + СимволРазделения;
			
			// 3.	№ носителя  категории льгот в домохозяйстве.	
			НоваяСтрока  = НоваяСтрока + НомерНосителяКатегорииЛьгот + СимволРазделения;
			
			// 4.	Фамилия носителя  категории льгот.
			НоваяСтрока  = НоваяСтрока + СтрокаЛьготник.Фамилия + СимволРазделения;
			
			// 5.	Имя носителя  категории льгот.
			НоваяСтрока  = НоваяСтрока + СтрокаЛьготник.Имя + СимволРазделения;
			
			// 6.	Отчество носителя  категории льгот.
			НоваяСтрока  = НоваяСтрока + СтрокаЛьготник.Отчество + СимволРазделения;
			
			// 7.	Дата рождения носителя  категории льгот.
			НоваяСтрока  = НоваяСтрока + Формат(СтрокаЛьготник.ДатаРождения,"ДФ=дд.ММ.гггг") + СимволРазделения;
			
			// 8.	Тип удостоверения льготника.
			НоваяСтрока  = НоваяСтрока + СтрокаЛьготник.ТипУдостоверения + СимволРазделения;
			
			// 9.	Серия удостоверения льготника.
			НоваяСтрока  = НоваяСтрока + СтрокаЛьготник.СерияДокумента + СимволРазделения;
			
			// 10.	Номер удостоверения льготника.
			НоваяСтрока  = НоваяСтрока + СтрокаЛьготник.НомерДокумента + СимволРазделения;
			
			// 11.	Дата выдачи удостоверения льготника.
			НоваяСтрока  = НоваяСтрока + Формат(СтрокаЛьготник.ДатаВыдачи,"ДФ=дд.ММ.гггг") + СимволРазделения;
			
			// 12.	Дата начала действия льготы.
			НоваяСтрока  = НоваяСтрока + Формат(СтрокаЛьготник.ДатаВыдачи,"ДФ=дд.ММ.гггг") + СимволРазделения;
			
			// 13.	Дата окончания действия льготы.
			НоваяСтрока  = НоваяСтрока + Формат(СтрокаЛьготник.СрокДействияЛьготы,"ДФ=дд.ММ.гггг") + СимволРазделения;
			
			// 14.	Количество членов семьи, на которых распространяется льгота.
			НоваяСтрока  = НоваяСтрока + 0 + СимволРазделения;
			
			// ДОБАВЛЕНИЕ СТРОКИ Льготник В ТЕКСТОВЫЙ ФАЙЛ.	
			Текст.ДобавитьСтроку(НоваяСтрока);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Текст;
	
КонецФункции	

&НаСервере
Функция СформироватьСтрокуУслугиНаСервере(Текст,Выборка,СимволРазделения,ТаблицаТарифов,ТаблицаЛьготников,КолЛьготников,КоличествоУслуг,ТаблицаЛьгот,ТЗПерерасчетЛьгот,ТЗРазовые,КоличествоСтрокПерерасчетов,ПредыдущийЛС,КоличествоСтрокЛьгот)

	// 1.	Тип строки (Фиксированное значение: 4).	
	ТипСтроки  = 4;
	
	НоваяСтрока  = "" + ТипСтроки + СимволРазделения;
	
	// 2.	Код услуги (из справочника).	
	КодУслуги = Выборка.Услуга.КодПоГУГЦЖС;
	
	НоваяСтрока  = НоваяСтрока + КодУслуги + СимволРазделения;
	
	// 3.	Входящее сальдо (Долг на начало месяца).	
	НачальноеСальдо = Выборка.НачальноеСальдо;
	
	НоваяСтрока  = НоваяСтрока + НачальноеСальдо + СимволРазделения;
	
	// 4.	Экономически обоснованный тариф. 	
	Для каждого строка из ТаблицаТарифов Цикл
		
		Если строка.Услуга = Выборка.Услуга и строка.ТипКвартиры = Выборка.ТипКвартиры
			и строка.СтатусКвартиры = Выборка.СтатусКвартиры 
			и строка.РежимПотребления = Выборка.РежимПотребления 
			и строка.Поставщик = Выборка.Поставщик 
			и строка.СпособРасчета = Выборка.СпособРасчета Тогда
			
			Тариф = строка.Тариф;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	НоваяСтрока  = НоваяСтрока + Тариф + СимволРазделения;
	
	// 5.	Регулируемый тариф.	
	НоваяСтрока  = НоваяСтрока + Тариф + СимволРазделения;
	
	// 6.	Код единицы измерения расхода (из справочника).
	Если Выборка.Услуга.СпособыРасчета.количество() = 0 Тогда
		КодЕдиницыИзмерения = "";
		
	Иначе	
		
		Для каждого Строка из Выборка.Услуга.СпособыРасчета Цикл
			
			Если Строка.СпособРасчета = Выборка.СпособРасчета Тогда
				
				КодЕдиницыИзмерения = Строка.ЕдИзм.Код;
				
			КонецЕсли;	
			
		КонецЦикла;;	
		
	КонецЕсли;	
	
	НоваяСтрока  = НоваяСтрока + КодЕдиницыИзмерения + СимволРазделения;
	
	// 7.	Расход фактический.
	РасходФактический = Выборка.Норма + Выборка.СверхНорма;
	
	НоваяСтрока  = НоваяСтрока + РасходФактический + СимволРазделения;
	
	// 8.	Расход по социальному нормативу.
	НоваяСтрока  = НоваяСтрока + Выборка.Норма + СимволРазделения;
	
	// 9.	Наличие прибора учета(1-по счетчику / 0-без счетчика).
	Если Выборка.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.РасчетПоСчетчикам")
		или Выборка.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикам")
		или Выборка.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоГрупповымСчетчикамСНаличиемИндивидуальных")
		или Выборка.СпособРасчета = ПредопределенноеЗначение("Перечисление.бит_СпособыРасчетаПоУслугам.ПоИндивидуальнымСчетчикам") Тогда
		
		НаличиеПрибораУчета = 1;
		
	Иначе
		НаличиеПрибораУчета = 0;
		
	КонецЕсли;
	
	НоваяСтрока  = НоваяСтрока + НаличиеПрибораУчета + СимволРазделения;
	
	// 10.	Сумма начисления по социальному нормативу по регулируемому тарифу.
	
	НоваяСтрока  = НоваяСтрока + Выборка.СуммаНачислений + СимволРазделения;
	
	// 11.	Сумма перерасчета начисления по социальному нормативу по регулируемому тарифу за предыдущий период (за все месяца).
	НоваяСтрока  = НоваяСтрока + Выборка.Разовые + СимволРазделения;
	
	
	// 12.	Сумма дотации
	НоваяСтрока  = НоваяСтрока + Выборка.СуммаНачислений + СимволРазделения;
	
	// 13.	Сумма перерасчета дотации за предыдущий период (за все месяца).
	НоваяСтрока  = НоваяСтрока + Выборка.Разовые + СимволРазделения;
	
	// 14.	Сумма льготы (Общая сумма льготы по всем категориям льгот для данной услуги).
	
	СуммаЛьготы = 0;
	
	Для каждого СтрокаЛьготы из ТаблицаЛьгот Цикл
		Если СтрокаЛьготы.ЛицевойСчет = Выборка.ЛицевойСчет и СтрокаЛьготы.Услуга = Выборка.Услуга Тогда
			
			СуммаЛьготы = СуммаЛьготы + СтрокаЛьготы.НачисленоЛьготы;
			
		КонецЕсли;
	КонецЦикла;
	
	НоваяСтрока  = НоваяСтрока + СуммаЛьготы + СимволРазделения;
	
	
	// 15.	Сумма перерасчета льготы за предыдущий период (Общая по всем категориям льгот для данной услуги) (за все месяца).
	
	СуммаПерерасчетаЛьготы = 0;
	Если Выборка.Разовые <> 0 Тогда
		
		Для Каждого СтрокаТЗПерерасчетЛьгот из ТЗПерерасчетЛьгот Цикл
			
			Если СтрокаТЗПерерасчетЛьгот.ЛицевойСчет = Выборка.ЛицевойСчет и СтрокаТЗПерерасчетЛьгот.УслугаЖКХ = Выборка.Услуга и СтрокаТЗПерерасчетЛьгот.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				СуммаПерерасчетаЛьготы  = СуммаПерерасчетаЛьготы + СтрокаТЗПерерасчетЛьгот.Сумма;
			ИначеЕсли СтрокаТЗПерерасчетЛьгот.ЛицевойСчет = Выборка.ЛицевойСчет и СтрокаТЗПерерасчетЛьгот.УслугаЖКХ = Выборка.Услуга и СтрокаТЗПерерасчетЛьгот.ВидДвижения = ВидДвиженияНакопления.Расход Тогда	
				СуммаПерерасчетаЛьготы  = СуммаПерерасчетаЛьготы - СтрокаТЗПерерасчетЛьгот.Сумма;
			КонецЕсли;	  
			
		КонецЦикла;	
		
		
	КонецЕсли;
	
	НоваяСтрока  = НоваяСтрока + СуммаПерерасчетаЛьготы + СимволРазделения;
	
	// 16.	Сумма оплаты, поступившие за месяц начислений.
	
	СуммаОплаты = Выборка.СуммаОплаты;
	
	НоваяСтрока  = НоваяСтрока + СуммаОплаты + СимволРазделения;
	
	// 17.	Количество строк перерасчетов начисления по социальному нормативу.
	// По регулируемому тарифу по месяцам (Строка – перерасчеты начисления для каждой услуги).
	
	ПредыдущаяСтрокаПериод = "";
	КоличествоСтрокПерерасчетов =0;
	Для каждого СтрокаРазовые из ТЗРазовые Цикл
		
		Если СтрокаРазовые.ЛицевойСчет = Выборка.ЛицевойСчет и СтрокаРазовые.УслугаЖКХ = Выборка.Услуга Тогда
			
			Если Формат(СтрокаРазовые.Период,"ДФ=ММ.гггг") <> ПредыдущаяСтрокаПериод Тогда
				
				КоличествоСтрокПерерасчетов	= КоличествоСтрокПерерасчетов + 1;
				
				ПредыдущаяСтрокаПериод = Формат(СтрокаРазовые.Период,"ДФ=ММ.гггг");
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;	
	
	НоваяСтрока  = НоваяСтрока + КоличествоСтрокПерерасчетов + СимволРазделения;
	
	// 18.	Количество строк начисленных льгот по категориям (Строка – начисленная льгота).
	
	ПредыдущаяСтрокаЛьгота = "";
	КоличествоСтрокЛьгот =0;
	Для каждого СтрокаЛьгота из ТаблицаЛьгот Цикл
		
		Если СтрокаЛьгота.ЛицевойСчет = Выборка.ЛицевойСчет и СтрокаЛьгота.Услуга = Выборка.Услуга Тогда
			
			Если НЕ СтрокаЛьгота.СрокЛьготыИстек и СтрокаЛьгота.Льгота <> ПредыдущаяСтрокаЛьгота Тогда
				
				КоличествоСтрокЛьгот = КоличествоСтрокЛьгот + 1;
				ПредыдущаяСтрокаЛьгота = СтрокаЛьгота.Льгота;
				
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЦикла;
	
	НоваяСтрока  = НоваяСтрока + КоличествоСтрокЛьгот + СимволРазделения;
	
	Текст.ДобавитьСтроку(НоваяСтрока);
	
	Возврат Текст;
	
КонецФункции	

&НаСервере
Функция СформироватьТаблицуЛьготНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(бит_НачислениеПоЛьготамОбороты.СуммаОборот, 0)) КАК НачисленоЛьготы,
	|	СУММА(ЕСТЬNULL(бит_НачислениеПоЛьготамОбороты.СуммаРазовыхОборот, 0)) КАК НачисленоЛьготыРазовые,
	|	СУММА(ЕСТЬNULL(бит_НачислениеПоЛьготамОбороты.СуммаСемейнойОборот, 0)) КАК НачисленоЛьготыСемейной,
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет,
	|	бит_НачислениеПоЛьготамОбороты.Услуга,
	|	бит_НачислениеПоЛьготамОбороты.Льгота,
	|	бит_НачислениеПоЛьготамОбороты.ФизЛицо,
	|	СУММА(ЕСТЬNULL(бит_НачислениеПоЛьготамОбороты.ОбъемОборот, 0)) КАК НачисленоЛьготыОбъем,
	|	ВЫБОР
	|		КОГДА бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы > &сг_КонецПериода
	|				ИЛИ бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СрокЛьготыИстек
	|ИЗ
	|	РегистрНакопления.бит_НачислениеПоЛьготам.Обороты(, &сг_КонецПериода, , ) КАК бит_НачислениеПоЛьготамОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ЛьготыПоЛС.СрезПоследних(&сг_КонецПериода, ) КАК бит_ЛьготыПоЛССрезПоследних
	|		ПО бит_НачислениеПоЛьготамОбороты.Льгота = бит_ЛьготыПоЛССрезПоследних.Льготы
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачислениеПоЛьготамОбороты.ЛицевойСчет,
	|	бит_НачислениеПоЛьготамОбороты.Услуга,
	|	бит_НачислениеПоЛьготамОбороты.Льгота,
	|	бит_НачислениеПоЛьготамОбороты.ФизЛицо,
	|	ВЫБОР
	|		КОГДА бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы > &сг_КонецПериода
	|				ИЛИ бит_ЛьготыПоЛССрезПоследних.СрокДействияЛьготы = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("сг_НачалоПериода",Объект.сг_НачалоПериода);
	Запрос.УстановитьПараметр("сг_КонецПериода",Объект.сг_КонецПериода);
	
	Результат = Запрос.Выполнить();
	
	ТаблицаЛьгот = Результат.Выгрузить();
	
	ТаблицаЛьгот.Сортировать("ЛицевойСчет Возр");
	
	Возврат ТаблицаЛьгот;
	
КонецФункции

&НаСервере
Процедура ОбработатьВыбранныеЗначения(ВыбранноеЗначение)
	
	ТаблицаЛС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресЛСВХранилище);
	
	Если ТаблицаЛС = Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка получения данных из временного хранилища. Выполните подбор заново.");
		Возврат;
		
	КонецЕсли; 
	
	Для каждого СтрокаЛС Из ТаблицаЛС Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет", СтрокаЛС.ЛицевойСчет);
		
		Поиск = Объект.ОтборЛицевыхСчетов.НайтиСтроки(Отбор);
		
		Если Поиск.Количество() = 0 Тогда
			
			НоваяСтрока = Объект.ОтборЛицевыхСчетов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЛС);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

#КонецОбласти
